Courses/7140/Projects/7140-2017-spring-project.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Spring 2017 Project Work</title>
<!-- 2017-03-21 Tue 05:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../Top/">CS 7140</a>
</div>
<div id="content">
<h1 class="title">Spring 2017 Project Work</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Project for Spring 2017: Batch Rename PDF files.</a></li>
<li><a href="#sec-2">2. Notes</a></li>
<li><a href="#sec-3">3. Domain Analysis</a></li>
<li><a href="#sec-4">4. End</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Project for Spring 2017: Batch Rename PDF files.</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>We extract the following:
<ol class="org-ol">
<li>The subject classification.  Last class example: "Software Comprehension"
</li>
<li>The year of publication.
</li>
<li>List of author names (First Middle Last)
</li>
<li>Name of conference or journal of publication
</li>
<li>This sound like a wicked problem, but is not.
</li>
<li>Some of this info may be missing in the pdf.
</li>
</ol>
</li>

<li>Rename a file using the extracted elements
<ol class="org-ol">
<li>Format control of the resulting string?
</li>
<li>See an example: <a href="https://www.id3renamer.com/moreinfo">https://www.id3renamer.com/moreinfo</a>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Background</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Overview of <a href="../Projects/pdf.html">PDF tools etc</a>.
</li>

<li>cf. <a href="http://labs.crossref.org/pdfextract/">http://labs.crossref.org/pdfextract/</a>.  Download and begin to
experiment.  Binary distribution.  Not source code.
</li>

<li>Get GitHub accounts.  Free. All source code and documents are
expected to be on GitHub.
</li>

<li><a href="https://github.com/CeON/CERMINE">https://github.com/CeON/CERMINE</a>  "is a Java library and a web
service (cermine.ceon.pl) for extracting metadata and content from
PDF files containing academic publications. CERMINE is written in
Java at Centre for Open Science at Interdisciplinary Centre for
Mathematical and Computational Modelling, University of Warsaw."
</li>

<li><a href="http://jats.nlm.nih.gov/archiving/tag-library/1.1/">http://jats.nlm.nih.gov/archiving/tag-library/1.1/</a> Journal
Archiving and Interchange Tag Library NISO JATS Version 1.1
(ANSI/NISO Z39.96-2015) December 2015
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Toward the Development of Requirements</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Immediate Goal: Develop Requirements, and document as expected in
the <a href="../../Projects/7140-project.html">Projects page</a>.  This is team work.  Due date: by next Mon
class?
</li>

<li>Important subsystem #1: Develop a "virtual machine" description
suitable for our project.  The product of this effort is an API.  E.g.,
<pre class="example">
fi = openPDF(pathName); y = extractYear(fi); s =  extractSubject(fi); closePDF(fi);
</pre>

<ol class="org-ol">
<li>Suggestion: Each of you gather, say 5, academic papers. Study
the range of where the info that we wish to extract lies.
</li>
</ol>
</li>

<li>Important subsystem #2: Do a mock up of a GUI that is an aid to
using the "Rename PDF Files" tool.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Life Cycle</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Imagine that Dr PM is the client commissioning this software.
</li>
<li>Requirements will/ should become clear as we progress.
</li>
<li>Bottom Line:  We will adjust the scope of the project as we go along.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Example of PDF Annotation</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Annotated file: <a href="./pdfextract-CrossRefLabs.pdf">./pdfextract-CrossRefLabs.pdf</a>
</li>
<li>Flattened after annotation file:
<a href="./pdfextract-CrossRefLabs-Flattened.pdf">./pdfextract-CrossRefLabs-Flattened.pdf</a>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Notes</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Notes on logistics <a href="./note20170318.html">./note20170318.html</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Domain Analysis</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> pdfRenamer Names of Fields To Extract</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This list is incomplete.
</p>

<ol class="org-ol">
<li>Topic: The subject/topic classification. Ex: "buffer overflow
exploit" "software engineering" "president obama's lectures"
</li>
<li>Year: The year of publication. Ex: "2016"
</li>
<li>Authors: One-author-name consists of [First Middle* Last], list
of author names is comma separated.  Ex: Umme Ayda Mannan,
Iftekhar Ahmed, Rana Abdullah M Almurshed, Danny Dig, Carlos
Jensen.  This example has 5 authors.
</li>
<li>JournalConf: Name of journal or conference. Ex: "Journal of ACM"
"USENIX Symposium on Networked Systems Design and
Implementation"
</li>
<li>Pages. Page numbers of the PDF. Ex: "32 - 54"
</li>
<li>Kind: PhD-thesis/ MS-thesis/ Tech-Report/ Manual/ Paper-Regular/
Slides/ Book/ Proceedings/ Unknown.
</li>
<li>Location: City and Country of Publication.  Ex: "London, UK"
"New York, NY, USA"
</li>
<li>Volume: Usually a number.  Some times a name.  Ex: "25"
</li>
<li>Issue:  Usually a number.  Some times a name.  Ex: "3" "March"
</li>
<li>Publisher/ Organization.  Ex: "Springer Verlag" "IEEE"
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Task Assignment Mar 21, 2017</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Apoorva: 2 Year, 10 Publisher
</li>
<li>Jayanth: 3 Authors, 9 Issue
</li>
<li>Jonathan: 4 JournalConf,  1 Topic
</li>
<li>Sarker: 5 Pages,  7 Location
</li>
<li>Stephanie: 6 Kind, 8 Volume
</li>

<li>Practice TDD, using either iText or PDFbox libraries
</li>
<li>What is due: A jar file containing the extract operations.
</li>
<li>Due Date: Fri Mar 24, 2017 11:59 PM
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2017-01-09
</div>
</body>
</html>
